TICKERS = {
    "AAPL": {
        "name": "Apple",
        "description": "Технологии",
        "facts": [
            "Первый логотип Apple изображал Исаака Ньютона под яблоней (1976)",
            "Стив Джобс продал свой микроавтобус Volkswagen за $750 для стартового капитала Apple",
            "iPhone был разработан под кодовым названием 'Project Purple'"
        ]
    },
    "TSLA": {
        "name": "Tesla",
        "description": "Электромобили",
        "facts": [
            "Первый Tesla Roadster использовал 6831 литий-ионный аккумулятор от ноутбуков",
            "Gigafactory в Неваде - второе по площади здание в мире",
            "Tesla получила $465 млн госсубсидий в 2010, но вернула их досрочно в 2013"
        ]
    },
    "MSFT": {
        "name": "Microsoft",
        "description": "технологии",
        "facts": [
            "Первый Tesla Roadster использовал 6831 литий-ионный аккумулятор от ноутбуков",
            "Gigafactory в Неваде - второе по площади здание в мире",
            "Tesla получила $465 млн госсубсидий в 2010, но вернула их досрочно в 2013"
        ]
    },
    "GOOGL": {
        "name": "Alphabet",
        "description": "Google",
        "facts": [
            "Название 'Google' - ошибка в написании слова 'googol' (10^100)",
            "Первый сервер Google был собран из Lego",
            "Gmail запустили 1 апреля 2004, и многие приняли это за шутку"
        ]
    },
    "AMZN": {
        "name": "Amazon",
        "description": "ритейл, облака",
        "facts": [
            "Джефф Безос основал Amazon в гараже с табличкой 'amazon.com' из досок",
            "Первая продажа Amazon - книга 'Fluid Concepts and Creative Analogies'",
            "AWS появился случайно - как побочный проект внутренней IT-инфраструктуры"
        ]
    },
    "META": {
        "name": "Meta",
        "description": "Facebook, Instagram",
        "facts": [
            "Первый прототип Facebook написан на PHP за 2 недели",
            "Сервера Facebook в 2005 охлаждались вентиляторами от Ford",
            "Instagram куплен за $1 млрд, когда в компании было 13 сотрудников"
        ]
    },
    "NVDA": {
        "name": "NVIDIA",
        "description": "чипы, AI",
        "facts": [
            "Название NVIDIA происходит от латинского 'invidia' (зависть)",
            "Первым продуктом была видеокарта NV1 с поддержкой Sega Saturn",
            "GPU изначально создавались для игр, но теперь доминируют в ИИ"
        ]
    },
    "SPY": {
       "name": "SPY",
        "description": "ETF на S&P 500",
        "facts": [ 
            "SPY часто используется для хеджирования рисков и спекуляций, а не только для долгосрочных инвестиций",
            "SPY (SPDR S&P 500 ETF Trust) был запущен в 1993 году и стал первым биржевым фондом (ETF) в истории",
            "Средний дневной оборот составляет $30–50 млрд, что делает его идеальным для крупных инвесторов"
        ]
    },
    "AMD": {
        "name": "Advanced Micro Devices",
        "description": "Центральные процессоры: Ryzen, EPYC",
        "facts": [
            "Основана 8 бывшими сотрудниками Fairchild Semiconductor",
            "Первым продуктом был аналог Intel 8080 с обратной совместимостью",
            "Ryzen разрабатывался под кодовым названием 'Zen' 4 года"
        ]
    },
    "PYPL": {
          "name": "PayPal",
        "description": "Онлайн-платежи",
        "facts": [
                "Изначально PayPal назывался Confinity и занимался криптографией",
                "Основатели PayPal позже создали Tesla, LinkedIn и YouTube",
                "Первый платеж через PayPal - $20 за покупку поврежденной книги"   
        ]
    }
}

COMPARISON_STOCKS = ["AAPL", "TSLA", "MSFT", "GOOGL", "AMZN", "META", "NVDA", "SPY", "AMD", "PYPL"]